---
kind: method
id: M:Autodesk.Revit.DB.Form.GetPathCurveIndexByCurveReference(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/b41baa61-77f3-41d6-d46b-a772e6c8d878.htm
---
# Autodesk.Revit.DB.Form.GetPathCurveIndexByCurveReference Method

**中文**: 对话框、窗口、窗体

Given a reference to certain curve in the path, return its index.

## Syntax (C#)
```csharp
public int GetPathCurveIndexByCurveReference(
	Reference curveReference
)
```

## Parameters
- **curveReference** (`Autodesk.Revit.DB.Reference`) - Reference to the curve in path